[{"_id":"5fc6a4b886c9bd4118a6aa43","title":"Poem -- \"Ozymandias\"","author":"Percy Bysshe Shelley","content":"<p style=\"text-align: center;\">I met a traveler from an antique land<br />Who said: &ldquo;Two vast and trunkless legs of stone<br />Stand in the desert . . . Near them, on the sand,<br />Half sunk, a shattered visage lies, whose frown,<br />And wrinkled lip, and sneer of cold command,<br />Tell that its sculptor well those passions read<br />Which yet survive, stamped on these lifeless things,<br />The hand that mocked them, and the heart that fed:<br />And on the pedestal these words appear:<br />&lsquo;My name is Ozymandias, king of kings:<br />Look on my works, ye Mighty, and despair!&rsquo;<br />Nothing beside remains. Round the decay<br />Of that colossal wreck, boundless and bare<br />The lone and level sands stretch far away.&rdquo;</p>\r\n<p>&nbsp;</p>\r\n<p><em><strong>Meaning of the Poem</strong></em></p>\r\n<p>In this winding story within a story within a poem, Shelley paints for us the image of the ruins of a statue of ancient Egyptian king Ozymandias, who is today commonly known as Ramesses II. This king is still regarded as the greatest and most powerful Egyptian pharaoh. Yet, all that&rsquo;s left of the statue are his legs, which tell us it was huge and impressive; the shattered head and snarling face, which tell us how tyrannical he was; and his inscribed quote hailing the magnificent structures that he built and that have been reduced to dust, which tells us they might not have been quite as magnificent as Ozymandias imagined. The image of a dictator-like king whose kingdom is no more creates a palpable irony. But, beyond that there is a perennial lesson about the inescapable and destructive forces of time, history, and nature. Success, fame, power, money, health, and prosperity can only last so long before fading into &ldquo;lone and level sands.&rdquo;</p>\r\n<p>There are yet more layers of meaning here that elevate this into one of the greatest poems. In terms of lost civilizations that show the ephemeralness of human pursuits, there is no better example than the Egyptians&mdash;who we associate with such dazzling monuments as the Sphinx and the Great Pyramid at Giza (that stands far taller than the Statue of Liberty)&mdash;yet who completely lost their spectacular language, culture, and civilization. If the forces of time, history, and nature can take down the Egyptian civilization, it begs the question, &ldquo;Who&rsquo;s next?&rdquo; Additionally, Ozymandias is believed to have been the villainous pharaoh who enslaved the ancient Hebrews and who Moses led the exodus from. If all ordinary pursuits, such as power and fame, are but dust, what remains, the poem suggests, are spirituality and morality&mdash;embodied by the ancient Hebrew faith. If you don&rsquo;t have those then in the long run you are a &ldquo;colossal wreck.&rdquo; Thus, the perfectly composed scene itself, the Egyptian imagery, and the Biblical backstory convey a perennial message and make this a great poem.</p>","image":"texture-1909992_1920.jpg","abstract":"Shelley paints for us the image of the ruins of a statue of ancient Egyptian king Ozymandias, who is today commonly known as Ramesses II.","date":"2020-11-01T00:00:00.000Z","genre":"Poem","__v":0},{"_id":"5fca76b4c0fc152ae86029c3","title":"Lake Louise","author":"Li Deng","content":"<p>Lake Louise is the highest permanent settlement in Canada.</p>\r\n<p>There are two distinct areas, the small hamlet (Lake Louise Village) 1540 meters (5052ft) and the actual lake 1731 meters (5680ft) which is situated 4 km (2.5 miles) uphill from the village.</p>\r\n<p>People who work in Lake Louise live in accommodation provided by their employer. There is a &ldquo;need to reside&rdquo; requirement in Lake Louise and all of Banff National Park. To be an eligible resident you must be employed or operate a business within the park, or be a spouse or dependent of someone who meets the criteria.</p>\r\n<p>Lake Louise is one of the most photographed sites in Canada and possibly the world.</p>\r\n<p>In the busy summer months up to 15,000 people a day visit the shore of Lake Louise between dawn and dusk.</p>\r\n<p>There are small fish that survive year round in the lake, such as Cutthroat Trout, Bull Trout and Mountain Whitefish.</p>\r\n<p>Water from Lake Louise eventually ends up across the country in Hudson Bay, which is part of the North Atlantic Ocean.</p>","image":"blue-green-turquoise-water-of-lake-louise-early-july.jpg","abstract":"This is about Lake Louise. ","date":"2020-12-04T00:00:00.000Z","genre":"Nature","__v":0},{"_id":"5fca7937e6a2aa03d4986e97","title":"Tips and Games to Make Skating a Fun Family Activity","author":"Shuwen Tan","content":"<p><em><strong>Skating</strong></em> is the perfect family sport. Make the most of the chilly weather and take your family ice skating for some active, wintery fun. If you don't live near a real skating rink, look for faux-ice options&mdash;many towns set up temporary outdoor rinks, especially for the holidays! Ice skating can be tricky for younger children and older adults, so make sure everyone is comfortable with the activity. Otherwise, lace up your skates and get ready for some fun!</p>\r\n<p><strong>Before start, check these will be very helpful:</strong></p>\r\n<ul>\r\n<li>Make sure your child&rsquo;s skates are comfortable, fit well, and are not too tight.</li>\r\n<li>Make sure your child is warm enough. As with all winter sports, nobody has fun if they are cold.</li>\r\n<li>Keep it short when starting out! Skating is exhausting for young kids.</li>\r\n<li>Prepare Candy or Chocolate,as prize to the game.</li>\r\n</ul>\r\n<p><strong>How to have fun while skating, there are 7 games on ice welcomed by kids:</strong></p>\r\n<ul>\r\n<li>Red light, green light: skate when the leader says green light, stop when the leader says red light, as you race/toddle to the finish line.</li>\r\n<li>ABC hunt: Scatter foam ABC letters around the ice and have the kids search for them in order. They must practice bending over and standing up again to pick up each letter. As a bonus, they work on early literacy skil</li>\r\n<li>Chocolate hunt: Same as ABC game above but scatter chocolate eggs, kisses, or other candy around the ice for the kids to pick up.</li>\r\n<li>Stuffed animal game: place a bunch of stuffed animals on the ice with a plastic bin at the far end. Kids have to carry the animal down the ice and place it in the bin. Skate back for the next animal and repeat. Plastic bin comes in handy when transporting animals to the ice as well.</li>\r\n<li>Set up an obstacle course with pool noodles, hula hoops, pylons, or other objects the kids must skate around</li>\r\n<li>Draw lines on the ice and have kids follow the lines. Vary it up with squiggly lines, circles, snails, etc.</li>\r\n<li>Ice Soccer: Like hockey but with a ball. Set up some nets or pylons and have the kids kick a ball to practice transferring weight from one foot to the other. Can be played as a team or just individually kicking the ball up and down the ice.</li>\r\n<li>Hockey: Kids love hockey sticks. Bring some plastic hockey sticks or invest in child-sized wooden sticks. Get the kids hitting a soft puck or a ball around the ice. And again, it can be played as a team game or just between parent and child.</li>\r\n</ul>","image":"Ice_Skating.jpg","abstract":"Skating is the perfect family sport. It’s always enjoyable to go gliding around a frozen pond or ice skating rink.","date":"2020-12-04T00:00:00.000Z","genre":"Life","__v":0},{"_id":"5fca89adb6a7083104f64f48","title":"Tips for Stress-free Family Skiing With Kids","author":"Shuwen Tan","content":"<p>Flying effortlessly down a snow-covered slope, feeling the wind in your face and soaking up the beautiful mountain scenery &mdash; there&rsquo;s a lot to love about skiing. It&rsquo;s a sport that kids can learn at a young age and continue doing for the rest of their lives. You&rsquo;ll squeal with delight when you first see your little one soar down the slopes unaided!</p>\r\n<p><strong>Ski When It&rsquo;s Warm-ish</strong></p>\r\n<p>Whenever possible &ndash; and especially for the first few times out &ndash; ski with your kids on bright, sunny days. No one likes being pelted by snow and wind, and kids have even less tolerance for discomfort. Skiing on a bluebird day when the snow has softened up will leave them with warm, fuzzy feelings about the sport.</p>\r\n<p>&nbsp;</p>\r\n<p><strong>Make Sure It&rsquo;s Fun</strong></p>\r\n<p>Don&rsquo;t make the whole trip about carrying gear, taking lessons, and skiing, skiing, skiing. Get them used to wearing all that snow apparel by letting them play outside and taking breaks. My kids have less stress when we stop every couple of hours for water, hot cocoa and special snacks. And I make sure to leave time for fun, like having a snowball fight!</p>\r\n<p>&nbsp;</p>\r\n<p><strong>Teach Them To Own It</strong></p>\r\n<p>If you want your kids to enjoy skiing for the long haul, get them into the habit of getting their own boots on, carrying their own skis, and clipping themselves in and out of their skis. I learned this the hard way, thinking I was making things easier on my daughter by helping her a lot. In reality I was encouraging her to take less pride and ownership in the sport. Seeing even younger, smaller kids carry their gear proved to both of us that she could handle the job.</p>\r\n<p>&nbsp;</p>\r\n<p><strong>Create Anticipation</strong></p>\r\n<p>Find videos on YouTube from the ski resort you will be visiting and watch them with your kids. Fear of the lift is common for beginners, so watch a video to make them a bit more familiar with how it workds. Go over the trail map and set a goal for what trails you want to check off your &ldquo;bucket list.&rdquo; If the resort has special trails or activities for kids, talk about them and get your kids excited!</p>","image":"family_skiing.jpg","abstract":"Skiing has become favorite winter family activity. Yes, skiing can be an enriching experience for both kids and adults","date":"2020-12-04T00:00:00.000Z","genre":"Life","__v":0},{"_id":"5fca8ba7b6a7083104f64f49","title":"5 Tips For Ice Fishing With Kids","author":"Andy Whitcomb","content":"<p>Fishing with kids can be extremely rewarding. Helping them experience the thrill of a hook up usually is more exciting than you catching a fish yourself. However, fishing, especially ice fishing with kids is a thorough test of your amateur guiding skills. Here are a few tips to keep in mind when taking the entire family ice fishing.</p>\r\n<p><strong>FIND SAFE ICE</strong><br />The first component of any ice fishing trip is safe ice. 5 inches is a commonly recommended thickness. You can check with other ice fishermen who have already been out, but always verify by drilling a test hole before you venture very far away from shore.</p>\r\n<p><strong>WEAR ICE TRACTION CLEATS</strong><br />If ice is thick enough, to help everyone get around, invest in slip-on ice traction cleats. If there is some snow cover, the heavy tread of most insolated boots may be enough but additional cleats can be a boost of confidence during a time when a slip can promptly end any outing involving ice fishing with kids.</p>\r\n<p><strong>BE SELECTIVE WHEN YOU VENTURE OUT</strong><br />Sometimes, it may just be too cold, especially for kids. However, when you do head to the frozen lake, there is an old adage: &ldquo;start warm, stay warm.&rdquo; Kids should dress in layers and be well protected from the cold. Purchase a big pack of those little shake-to-activate hand warmers. Kids love fiddling with them. Closely monitor their warmth. No fishing is worth hypothermia.</p>\r\n<p><strong>THINK OF FAMILY ICE FISHING AS DAY CAMPING</strong><br />A little tent or hut not only provides protection from wind exposure but it raises the fun level of the whole outing because you are hanging out in a &ldquo;club house.&rdquo; Ample snacks and a thermos of hot chocolate are highly advised as well.</p>\r\n<p><strong>BRING BAIT</strong><br />Don't forget the bait. When ice fishing with kids, you want to keep the odds in your favor for catching fish and bait is hard to beat. Also, a bucket of minnows or a container of wiggling meal worms can be something else to hold their attention while awaiting a nibble.</p>\r\n<p>Stay safe, stay warm, and keep it short. As the old show biz saying goes, &ldquo;always leave them wanting more.&rdquo; Don&rsquo;t push it, so they&rsquo;ll want to come back again.</p>","image":"ice_fishing3.jpg","abstract":"Ice fishing is a unique and exciting way to fish. If your family enjoys fishing during the warmer months, there’s no reason to stop when the weather turns cold.","date":"2020-12-03T00:00:00.000Z","genre":"Life","__v":0},{"_id":"5fca8d54b6a7083104f64f4a","title":"How to Enjoy Snow Painting At First Time","author":"Shuwen Tan","content":"<p>Aside from a yard full of snow, the only supplies you need to paint the snow are some tempera paints and paint brushes.</p>\r\n<p>All activities should be supervised by an adult. This post contains affiliate links- this just means I earn a small commission if you purchase via links below, no extra cost to you! Read our disclosure policy here.</p>\r\n<p>MATERIALS FOR PAINTING SNOW ACTIVITY:</p>\r\n<ul>\r\n<li>Fiber filling (pillow stuffing)</li>\r\n<li>Washable kids paint</li>\r\n<li>Flat bin</li>\r\n<li>Paint brushes</li>\r\n<li>Water</li>\r\n<li>Paper cups</li>\r\n</ul>\r\n<p>INSTRUCTIONS:<br />Dump the pillow stuffing into the bin. Add some water to the paper cups and a bit of desired paint colors</p>\r\n<p>Using the three primary colors, you can make several other colors by these combinations:</p>\r\n<ul>\r\n<li>Yellow + blue = green</li>\r\n<li>Red + blue = purple</li>\r\n<li>Red + yellow = orange</li>\r\n</ul>\r\n<p>Encourage your kids to make a snowman or snow fort, and then decorate them using the paint. Before you try, it is hard to imagine that this will be so awesome.</p>","image":"snow_painting2.jpg","abstract":"The best use for a pile of snow might just be painting it!","date":"2020-12-02T00:00:00.000Z","genre":"Life","__v":0},{"_id":"5fca91afb6a7083104f64f4b","title":"Poem--“The Tiger” ","author":"William Blake","content":"<p style=\"text-align: center;\">Tiger Tiger, burning bright,<br />In the forests of the night;<br />What immortal hand or eye,<br />Could frame thy fearful symmetry?</p>\r\n<p style=\"text-align: center;\">In what distant deeps or skies.<br />Burnt the fire of thine eyes?<br />On what wings dare he aspire?<br />What the hand, dare seize the fire?</p>\r\n<p style=\"text-align: center;\">And what shoulder, and what art,<br />Could twist the sinews of thy heart?<br />And when thy heart began to beat,<br />What dread hand? and what dread feet?</p>\r\n<p style=\"text-align: center;\">What the hammer? what the chain,<br />In what furnace was thy brain?<br />What the anvil? what dread grasp,<br />Dare its deadly terrors clasp!</p>\r\n<p style=\"text-align: center;\">When the stars threw down their spears<br />And water&rsquo;d heaven with their tears:<br />Did he smile his work to see?<br />Did he who made the Lamb make thee?</p>\r\n<p style=\"text-align: center;\">Tiger Tiger burning bright,<br />In the forests of the night:<br />What immortal hand or eye,<br />Dare frame thy fearful symmetry?</p>\r\n<p>&nbsp;</p>\r\n<p><strong><em>Meaning of the Poem</em></strong></p>\r\n<p>This poem contemplates a question arising from the idea of creation by an intelligent creator. The question is this: If there is a loving, compassionate God or gods who created human beings and whose great powers exceed the comprehension of human beings, as many major religions hold, then why would such a powerful being allow evil into the world. Evil here is represented by a tiger that might, should you be strolling in the Indian or Chinese wild in the 1700s, have leapt out and killed you. What would have created such a dangerous and evil creature? How could it possibly be the same divine blacksmith who created a cute harmless fluffy lamb or who created Jesus, also known as the &ldquo;Lamb of God&rdquo; (which the devoutly Christian Blake was probably also referring to here). To put it another way, why would such a divine blacksmith create beautiful innocent children and then also allow such children to be slaughtered. The battery of questions brings this mystery to life with lavish intensity.</p>\r\n<p>Does Blake offer an answer to this question of evil from a good God? It would seem not on the surface. But, this wouldn&rsquo;t be a great poem if it were really that open ended. The answer comes in the way that Blake explains the question. Blake&rsquo;s language peels away the mundane world and offers a look at the super-reality to which poets are privy. We fly about in &ldquo;forests of the night&rdquo; through &ldquo;distant deeps or skies&rdquo; looking for where the fire in the tiger&rsquo;s eye was taken from by the Creator. This is the reality of expanded time, space, and perception that Blake so clearly elucidates elsewhere with the lines &ldquo;To see a world in a grain of sand / And a heaven in a wild flower, / Hold infinity in the palm of your hand, / And eternity in an hour&rdquo; (&ldquo;Auguries of Innocence&rdquo;). This indirectly tells us that the reality that we ordinarily know and perceive is really insufficient, shallow, and deceptive. Where we perceive the injustice of the wild tiger something else entirely may be transpiring. What we ordinarily take for truth may really be far from it: a thought that is scary, yet also sublime or beautiful&mdash;like the beautiful and fearsome tiger. Thus, this poem is great because it concisely and compellingly presents a question that still plagues humanity today, as well as a key clue to the answer.</p>\r\n<h2>&nbsp;</h2>","image":"tiger-burning-bright.jpg","abstract":"Tiger Tiger, burning bright / In the forests of the night / What immortal hand or eye / Could frame thy fearful symmetry?","date":"2020-12-05T00:00:00.000Z","genre":"Poem","__v":0},{"_id":"5fca9378b6a7083104f64f4c","title":"Peom -- \"Daffodils\"","author":"William Wordsworth","content":"<p style=\"text-align: center;\">I wandered lonely as a cloud<br />That floats on high o&rsquo;er vales and hills,<br />When all at once I saw a crowd,<br />A host, of golden daffodils;<br />Beside the lake, beneath the trees,<br />Fluttering and dancing in the breeze.</p>\r\n<p style=\"text-align: center;\">Continuous as the stars that shine<br />And twinkle on the milky way,<br />They stretched in never-ending line<br />Along the margin of a bay:<br />Ten thousand saw I at a glance,<br />Tossing their heads in sprightly dance.</p>\r\n<p style=\"text-align: center;\">The waves beside them danced; but they<br />Out-did the sparkling waves in glee:<br />A poet could not but be gay,<br />In such a jocund company:<br />I gazed&mdash;and gazed&mdash;but little thought<br />What wealth the show to me had brought:</p>\r\n<p style=\"text-align: center;\">For oft, when on my couch I lie<br />In vacant or in pensive mood,<br />They flash upon that inward eye<br />Which is the bliss of solitude;<br />And then my heart with pleasure fills,<br />And dances with the daffodils.</p>\r\n<p><em><strong>Meaning of the Poem</strong></em></p>\r\n<p>Through the narrator&rsquo;s chance encounter with a field of daffodils by the water, we are presented with the power and beauty of the natural world. It sounds simple enough, but there are several factors that contribute to this poem&rsquo;s greatness. First, the poem comes at a time when the Western world is industrializing and man feels spiritually lonely in the face of an increasingly godless worldview. This feeling is perfectly harnessed by the depiction of wandering through the wilderness &ldquo;lonely as a cloud&rdquo; and by the ending scene of the narrator sadly lying on his couch &ldquo;in vacant or in pensive mood&rdquo; and finding happiness in solitude. The daffodils then become more than nature; they become a companion and a source of personal joy. Second, the very simplicity itself of enjoying nature&mdash;flowers, trees, the sea, the sky, the mountains etc.&mdash;is perfectly manifested by the simplicity of the poem: the four stanzas simply begin with daffodils, describe daffodils, compare daffodils to something else, and end on daffodils, respectively. Any common reader can easily get this poem, as easily as her or she might enjoy a walk around a lake.</p>\r\n<p>Third, Wordsworth has subtly put forward more than just an ode to nature here. Every stanza mentions dancing and the third stanza even calls the daffodils &ldquo;a show.&rdquo; At this time in England, one might have paid money to see an opera or other performance of high artistic quality. Here, Wordsworth is putting forward the idea that nature can offer similar joys and even give you &ldquo;wealth&rdquo; instead of taking it from you, undoing the idea that beauty is attached to earthly money and social status. This, coupled with the language and topic of the poem, which are both relatively accessible to the common man, make for a great poem that demonstrates the all-encompassing and accessible nature of beauty and its associates, truth and bliss.</p>","image":"daffoldils.jpg","abstract":"Continuous as the stars that shine / And twinkle on the milky way, / They stretched in never-ending line / Along the margin of a bay: / Ten thousand saw I at a glance, / Tossing their heads in sprightly dance.","date":"2020-12-06T00:00:00.000Z","genre":"Poem","__v":0},{"_id":"5fca95b6b6a7083104f64f4d","title":"Poem -- \"The Road Not Taken\"","author":"Robert Frost","content":"<p style=\"text-align: center;\">Two roads diverged in a yellow wood,<br />And sorry I could not travel both<br />And be one traveler, long I stood<br />And looked down one as far as I could<br />To where it bent in the undergrowth;</p>\r\n<p style=\"text-align: center;\">Then took the other, as just as fair,<br />And having perhaps the better claim,<br />Because it was grassy and wanted wear;<br />Though as for that the passing there<br />Had worn them really about the same,</p>\r\n<p style=\"text-align: center;\">And both that morning equally lay<br />In leaves no step had trodden black.<br />Oh, I kept the first for another day!<br />Yet knowing how way leads on to way,<br />I doubted if I should ever come back.</p>\r\n<p style=\"text-align: center;\">I shall be telling this with a sigh<br />Somewhere ages and ages hence:<br />Two roads diverged in a wood, and I&mdash;<br />I took the one less traveled by,<br />And that has made all the difference.</p>\r\n<p>&nbsp;</p>\r\n<p><em><strong>Meaning of the Poem</strong></em></p>\r\n<p>This poem deals with that big noble question of &ldquo;How to make a difference in the world?&rdquo; On first reading, it tells us that the choice one makes really does matter, ending: &ldquo;I took the one less traveled by, / And that has made all the difference.&rdquo;</p>\r\n<p>A closer reading reveals that the lonely choice that was made earlier by our traveling narrator maybe wasn&rsquo;t all that significant since both roads were pretty much the same anyway (&ldquo;Had warn them really about the same&rdquo;) and it is only in the remembering and retelling that it made a difference. We are left to ponder if the narrator had instead traveled down &ldquo;The Road Not Taken&rdquo; might it have also made a difference as well. In a sense, &ldquo;The Road Not Taken&rdquo; tears apart the traditional view of individualism, which hinges on the importance of choice, as in the case of democracy in general (choosing a candidate), as well as various constitutional freedoms: choice of religion, choice of words (freedom of speech), choice of group (freedom of assembly), and choice of source of information (freedom of press). For example, we might imagine a young man choosing between being a carpenter or a banker later seeing great significance in his choice to be a banker, but in fact there was not much in his original decision at all other than a passing fancy. In this, we see the universality of human beings: the roads leading to carpenter and banker being basically the same and the carpenter and bankers at the end of them&mdash;seeming like individuals who made significant choices&mdash;really being just part of the collective of the human race.</p>\r\n<p>Then is this poem not about the question &ldquo;How to make a difference in the world?&rdquo; after all? No. It is still about this question. The ending is the most clear and striking part. If nothing else, readers are left with the impression that our narrator, who commands beautiful verse, profound imagery, and time itself (&ldquo;ages and ages hence&rdquo;) puts value on striving to make a difference. The striving is reconstituted and complicated here in reflection, but our hero wants to make a difference and so should we. That is why this is a great poem, from a basic or close reading perspective.</p>","image":"road.jpg","abstract":"This poem deals with that big noble question of “How to make a difference in the world?” ","date":"2020-12-05T00:00:00.000Z","genre":"Poem","__v":0},{"_id":"5fcc0b68737308af509e22a1","title":"Lake Superior","author":"Chris","content":"<p>Hello, this is Lake Superior.</p>\r\n<p>Lake Superior is not only the largest of the Great Lakes; it is the largest body of fresh water on Earth. Situated on the northern edge of Wisconsin, Lake Superior extends from the upper peninsula of Michigan north to Ontario, Canada, and reaches west to the eastern edge of Minnesota. The name Superior refers to its size and also designates the lake's position as the northernmost of all the Great Lakes.</p>\r\n<p>The lake is about 160 miles (257 kilometers) wide and about 350 miles (563 km) long. It has a surface area of 31,700 square miles (82,100 square km) and water volume of 2,900 cubic miles (12,100 cubic km). The shoreline measures 2,726 miles (4,385 km), according to the Environmental Protection Agency (EPA).</p>","image":"lake2.jpg","abstract":"Lake Superior is not only the largest of the Great Lakes; it is the largest body of fresh water on Earth.","date":"2020-12-03T00:00:00.000Z","genre":"Nature","__v":0}]